//------------------------------------------------------------------------------
// This is Open source software. You can place this code on your site, but don't
// forget a link to my YouTube-channel: https://www.youtube.com/channel/UChButpZaL5kUUl_zTyIDFkQ
// Это программное обеспечение распространяется свободно. Вы можете размещать
// его на вашем сайте, но не забудьте указать ссылку на мой YouTube-канал 
// "Электроника в объектике" https://www.youtube.com/channel/UChButpZaL5kUUl_zTyIDFkQ
// Автор: Надыршин Руслан / Nadyrshin Ruslan
//------------------------------------------------------------------------------
#include <ioavr.h>
#include <inavr.h>
#include "..\delay\delay.h"
#include "hd44780.h"
#include "cp1251toepson.h"
#include "cp866toepson.h"

#include <stdio.h>
#include <stdlib.h>
#include <stdarg.h>
#include <string.h>


// Макросы для управления выходами
#define HD44780_RS_HIGH()       HD44780_RS_Port |= HD44780_RS_Mask
#define HD44780_RS_LOW()        HD44780_RS_Port &= ~HD44780_RS_Mask
#define HD44780_RW_HIGH()       HD44780_RW_Port |= HD44780_RW_Mask
#define HD44780_RW_LOW()        HD44780_RW_Port &= ~HD44780_RW_Mask
#define HD44780_E_HIGH()        HD44780_E_Port |= HD44780_E_Mask
#define HD44780_E_LOW()         HD44780_E_Port &= ~HD44780_E_Mask

char LastRow = 0;                                               // Последняя установленная строка
char hd44780_StrBuff[HD44780_COLS * HD44780_ROWS + 8];          // Буфер строки для вывода


//==============================================================================
// Функция чтения байта из hd44780
// - IsCmd - чтение статусного байта (иначе байта данных)
//==============================================================================
unsigned char hd44780_read(char IsCmd)
{
  unsigned char Data = 0;
  
  if (IsCmd)
    HD44780_RS_LOW();
  else
    HD44780_RS_HIGH();
  
  HD44780_RW_HIGH();
  
#if HD44780_4bitMode
  // Считываем старшую тетраду
  HD44780_E_HIGH();
  delay_us(HD44780_ShortDelayUs);
  Data = (HD44780_Data_Pin >> HD44780_Data_Shift) << 4;
  HD44780_E_LOW();

  delay_us(HD44780_ShortDelayUs);

  // Считываем младшую тетраду
  HD44780_E_HIGH();
  delay_us(HD44780_ShortDelayUs);
  Data |= (HD44780_Data_Pin >> HD44780_Data_Shift) & 0xF;
  HD44780_E_LOW();
#else
  HD44780_E_HIGH();
  delay_us(HD44780_ShortDelayUs);
  // Считываем байт с шины данных
  Data = HD44780_Data_Pin;
  HD44780_E_LOW();
#endif
  
  HD44780_RW_LOW();

  return Data;
}
//==============================================================================


//==============================================================================
// Процедура записи байта из hd44780
// - IsCmd - запись командного байта (иначе байта данных)
//==============================================================================
void hd44780_write(unsigned char Data, char IsCmd)
{
  if (IsCmd)
    HD44780_RS_LOW();
  else
    HD44780_RS_HIGH();
  
#if HD44780_4bitMode
  // Настраиваем биты данных как выходы
  HD44780_Data_DDR |= (0xF << HD44780_Data_Shift);
  
  // Выдаём старшую тетраду
  HD44780_Data_Port &= ~(0xF << HD44780_Data_Shift);
  HD44780_Data_Port |= ((Data >> 4) << HD44780_Data_Shift);
  HD44780_E_HIGH();
  delay_us(HD44780_ShortDelayUs);
  HD44780_E_LOW();

  delay_us(HD44780_ShortDelayUs);

  // Выдаём младшую тетраду
  HD44780_Data_Port &= ~(0xF << HD44780_Data_Shift);
  HD44780_Data_Port |= ((Data & 0xF) << HD44780_Data_Shift);
  HD44780_E_HIGH();
  delay_us(HD44780_ShortDelayUs);
  HD44780_E_LOW();
  
  // Настраиваем биты данных как входы
  HD44780_Data_DDR &= ~(0xF << HD44780_Data_Shift);
#else
  // Настраиваем биты данных как выходы
  HD44780_Data_DDR |= 0xFF;
  
  // Выдаём байт
  HD44780_Data_Port = Data;
  HD44780_E_HIGH();
  delay_us(HD44780_ShortDelayUs);
  HD44780_E_LOW();
  
  // Настраиваем биты данных как входы
  HD44780_Data_DDR &= ~0xFF;
#endif
}
//==============================================================================


//==============================================================================
// Функция ожидания освобождения контроллера дисплея (если HD44780_WaitBisyFlag=1)
//==============================================================================
#if (HD44780_WaitBisyFlag)
unsigned char hd44780_waitbisy(unsigned char tick)
{
  while ((hd44780_read(1) & 0x80) && (tick)) 
  {
    tick--;
  }
  
  return (tick) ? 0 : 1;
}
#endif
//==============================================================================


//==============================================================================
// Процедура записи команды с ожиданием освобождения контроллера дисплея
//==============================================================================
void hd44780_write_cmd(unsigned char Data)
{
#if (HD44780_WaitBisyFlag)
  hd44780_waitbisy(100);
#endif
  
  hd44780_write(Data, 1);

#if (!HD44780_WaitBisyFlag)
  delay_us(HD44780_BisyDelayUs);
#endif
}
//==============================================================================


//==============================================================================
// Процедура записи байта данных с ожиданием освобождения контроллера дисплея
//==============================================================================
void hd44780_write_data(unsigned char Data)
{
#if (HD44780_WaitBisyFlag)
  hd44780_waitbisy(100);
#endif

  hd44780_write(Data, 0);

#if (!HD44780_WaitBisyFlag)
  delay_us(HD44780_BisyDelayUs);
#endif
}
//==============================================================================


//==============================================================================
// Процедура инициализации ног МК для работы с hd44780
//==============================================================================
void hd44780_bus_init(void)
{
  // Все ноги, управляющие шиной настраиваем как выходы
  HD44780_E_DDR |= HD44780_E_Mask;
  HD44780_RS_DDR |= HD44780_RS_Mask;

#if (HD44780_WaitBisyFlag)
  HD44780_RW_DDR |= HD44780_RW_Mask;
#else
  //HD44780_RW_DDR |= HD44780_RW_Mask;
  //HD44780_RW_LOW();
#endif
  
#if HD44780_4bitMode
  HD44780_Data_DDR &= ~(0xF << HD44780_Data_Shift);
#else
  HD44780_Data_DDR &= ~0xFF;
#endif
}
//==============================================================================


//==============================================================================
// Процедура инициализации дисплея (отправка последовательности команд в дисплей)
//==============================================================================
void hd44780_start(void)
{
#if HD44780_4bitMode
  unsigned char Reg = 0x20;
#else
  unsigned char Reg = 0x30;
#endif

#if (HD44780_ROWS > 1)
  Reg |= 0x08;
#endif
  
  hd44780_write_cmd(Reg);       // Размер символа, 8бит шина данных
  hd44780_write_cmd(0x0C);      // Включаем дисплей
  hd44780_write_cmd(0x06);      // Автоинкремент адреса
  hd44780_clear();              // Очистка экрана
}
//==============================================================================


//==============================================================================
// Процедура инициализации дисплея
//==============================================================================
void hd44780_init(void)
{
  hd44780_bus_init();
  delay_ms(100);
  hd44780_start();
}
//==============================================================================


//==============================================================================
// Процедура установки курсора дисплея
//==============================================================================
void hd44780_goto_xy(char Row, char Col)
{
  // Вычисляем начальный адрес нужной строки
  unsigned char Adr = 0;            
  if (Row & 1)                  // Нечётные строки с т.з. hd44780 - вторая строка
    Adr = 0x40;                 // делаем смещение до второй строки hd44780
  if (Row > 1)                  // Для 4-строчного дисплея при выборе строки > 2
    Adr += HD44780_COLS;        // делаем сдвиг адреса на длину строки

  // Добавляем сдвиг в строке
  Adr += Col;
  
  // Пишем полученный адрес DRAM в hd44780
  hd44780_write_cmd(Adr | 0x80);        // команда установки адреса в DRAM
  
  LastRow = Row;
}
//==============================================================================


//==============================================================================
// Процедура очистки дисплея
//==============================================================================
void hd44780_clear(void)
{
  hd44780_write_cmd(0x01);      // Очистка экрана

#if (!HD44780_WaitBisyFlag)
  delay_ms(2);
#endif
}
//==============================================================================


//==============================================================================
// Процедура записи в дисплей массива байт
//==============================================================================
void hd44780_write_buff(char *pBuff, char Len)
{
  while (Len--)
  {
    hd44780_write_data(*(pBuff++));
  }
}
//==============================================================================


//==============================================================================
// Процедура отправки ANSI-строки в текущую позицию дисплея
//==============================================================================
void hd44780_puts(char *str)
{
  char i;
  
  while (*str != '\0')
  {
    switch (*str)
    {
    case '\n':  // Переход на новую строку
      LastRow++;
      hd44780_goto_xy(LastRow, 0);
      break;
    case '\r':
      hd44780_goto_xy(LastRow, 0);
      break;
    case '\t':
      for (i = 0; i < 4; i++)
        hd44780_write_data(0x20);
      break;
    default:
        hd44780_write_data(*str);
      break;
    }
    str++;
  }
}
//==============================================================================


//==============================================================================
// Процедура форматированного вывода начиная с текущей позиции курсора
//==============================================================================
void hd44780_printf(const char *args, ...)
{
  va_list ap;
  va_start(ap, args);
  char len = vsnprintf(hd44780_StrBuff, sizeof(hd44780_StrBuff), args, ap);
  va_end(ap);

  // Перекодирование русских символов в кодировку EPSON для дисплеев hd44780
#if (SOURCE_CODEPAGE == CP1251)
  cp1251_to_epson_convert(hd44780_StrBuff);
#else
  cp866_to_epson_convert(hd44780_StrBuff);
#endif
  
  hd44780_puts(hd44780_StrBuff);
}
//==============================================================================
