//------------------------------------------------------------------------------
// This is Open source software. You can place this code on your site, but don't
// forget a link to my YouTube-channel: https://www.youtube.com/channel/UChButpZaL5kUUl_zTyIDFkQ
// Это программное обеспечение распространяется свободно. Вы можете размещать
// его на вашем сайте, но не забудьте указать ссылку на мой YouTube-канал 
// "Электроника в объектике" https://www.youtube.com/channel/UChButpZaL5kUUl_zTyIDFkQ
// Автор: Надыршин Руслан / Nadyrshin Ruslan
//------------------------------------------------------------------------------
#include "i2cm.h"
#include "mlx9061x.h"



//==============================================================================
// Процедура инициализации интерфейса обмена с mlx9061x
//==============================================================================
void mlx90614_init(void)
{
  i2cm_init(MLX9061X_I2C_CLOCK);
}
//==============================================================================


//==============================================================================
// Функция дополняет CRC-8 (x8+x2+x1+1) очередным байтом
//==============================================================================
uint8_t mlx90614_crc8_byte(uint8_t Data, uint8_t Crc)
{
  Crc ^= Data;
  for (uint8_t i = 0; i < 8; i++) 
    Crc = Crc & 0x80 ? Crc << 1 ^ 0x07 : Crc << 1;
  
  return Crc;
}
//==============================================================================


//==============================================================================
// Функция рассчёта CRC-8 (x8+x2+x1+1) по массиву байт
//==============================================================================
uint8_t mlx90614_crc8_buff(uint8_t *p, uint8_t len)
{
  uint8_t crc = 0;

  while (len--)
    crc = mlx90614_crc8_byte(*(p++), crc);

  return crc;
}
//==============================================================================


//==============================================================================
// Функция чтения 1 регистра из mlx9061x
//==============================================================================
int8_t mlx9061x_ReadReg(uint8_t slave_addr, uint8_t RamAddr, float *pTemp)
{
  int8_t err;
  uint8_t crc = 0;
  uint8_t ReadBuff[3];

  // Выдаём первый START на шину
  err = i2cm_Start(MLX9061X_I2C_ADDR, 0, MLX9061X_I2C_TO);
  crc = mlx90614_crc8_byte(MLX9061X_I2C_ADDR, crc);
  if (err) return err;
  // Выдаём команду (внутренний адрес) в mlx9061x
  err = i2cm_WriteBuff(&RamAddr, 1, MLX9061X_I2C_TO);
  crc = mlx90614_crc8_byte(RamAddr, crc);
  if (err) return err;

  // Выдаём повторный START перед началом чтения
  err = i2cm_Start(MLX9061X_I2C_ADDR, 1, MLX9061X_I2C_TO);
  crc = mlx90614_crc8_byte(MLX9061X_I2C_ADDR | 1, crc);
  if (err) return err;
  
  // Читаем 2 байта и CRC (PEC)
  err = i2cm_ReadBuffAndStop(ReadBuff, 3, MLX9061X_I2C_TO);
  if (err) return err;
  
  // Считаем CRC и сверяем с байтом PEC
  for (uint8_t i = 0; i < 3; i++)
    crc = mlx90614_crc8_byte(ReadBuff[i], crc);
  if (crc)
    return MLX9061X_ERR_BadChksum;
  
  // Пересчитываем в физ. величины
  uint16_t Temp16 = ReadBuff[0] | (((uint16_t)ReadBuff[1]) << 8);
  
  if (Temp16 & 0x8000)
    return MLX9061X_ERR_MeasErr;
  
  *pTemp = (float)(Temp16 - 13658) / 50;       // 273.16 * 50 = 13658
  
  return MLX9061X_ERR_Ok;
}
//==============================================================================


//==============================================================================
// Функция чтения Ambient Temp (температура самого термометра)
//==============================================================================
int8_t mlx9061x_ReadTa(uint8_t slave_addr, float *pTemp)
{
  return mlx9061x_ReadReg(slave_addr, 6, pTemp);
}
//==============================================================================


//==============================================================================
// Функция чтения Оbject Temp 1 (температура объекта по первому ИК-измерителю)
//==============================================================================
int8_t mlx9061x_ReadTo1(uint8_t slave_addr, float *pTemp)
{
  return mlx9061x_ReadReg(slave_addr, 7, pTemp);
}
//==============================================================================


//==============================================================================
// Функция чтения Оbject Temp 2 (температура объекта по второму ИК-измерителю)
//==============================================================================
int8_t mlx9061x_ReadTo2(uint8_t slave_addr, float *pTemp)
{
  return mlx9061x_ReadReg(slave_addr, 8, pTemp);
}
//==============================================================================
